utn-fra-lse/lpc845/ejercicios/lpc845_breakout_board/src/fsl_component_mem_manager_light.c
    (void)memset((void *)guardPostPattern, BLOCK_HDR_POSTGUARD_PATTERN, BLOCK_HDR_POSTGUARD_SIZE);
    ret = memcmp((const void *)&BlockHdr->postguard, (const void *)guardPostPattern, BLOCK_HDR_POSTGUARD_SIZE);
    if (ret != 0)
    {
        MEM_DBG_LOG("Postguard Block Header Corrupted %x", BlockHdr);
    }
    assert(ret == 0);
}

static void MEM_BlockHeaderSetGuards(blockHeader_t *BlockHdr)
{
    (void)memset((void *)&BlockHdr->preguard, BLOCK_HDR_PREGUARD_PATTERN, BLOCK_HDR_PREGUARD_SIZE);
    (void)memset((void *)&BlockHdr->postguard, BLOCK_HDR_POSTGUARD_PATTERN, BLOCK_HDR_POSTGUARD_SIZE);
}

#endif

static memAreaPrivDesc_t *MEM_GetAreaByAreaId(uint8_t area_id)
{
    memAreaPrivDesc_t *p_area = &heap_area_list;
    for (uint8_t i = 0u; i < area_id; i++)
    {
        p_area = (memAreaPrivDesc_t *)p_area->next;
    }
    return p_area;
}

/*! *********************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
********************************************************************************** */

#if defined(MEM_STATISTICS_INTERNAL)
static void MEM_Reports_memStatis(void)
{
    MEM_DBG_LOG("**************** MEM STATS REPORT **************");
    MEM_DBG_LOG("Nb Alloc:                  %d\r\n", s_memStatis.nb_alloc);
    MEM_DBG_LOG("Small buffers:             %d\r\n", s_memStatis.nb_small_buffer);
    MEM_DBG_LOG("Medium buffers:            %d\r\n", s_memStatis.nb_medium_buffer);
    MEM_DBG_LOG("Large buffers:             %d\r\n", s_memStatis.nb_large_buffer);
    MEM_DBG_LOG("Peak small:                %d\r\n", s_memStatis.peak_small_buffer);
    MEM_DBG_LOG("Peak medium:               %d\r\n", s_memStatis.peak_medium_buffer);
    MEM_DBG_LOG("Peak large:                %d\r\n", s_memStatis.peak_large_buffer);
    MEM_DBG_LOG("Current RAM allocated:     %d bytes\r\n", s_memStatis.ram_allocated);
    MEM_DBG_LOG("Peak RAM allocated:        %d bytes\r\n", s_memStatis.peak_ram_allocated);
    MEM_DBG_LOG("Current RAM lost:          %d bytes\r\n", s_memStatis.ram_lost);
    MEM_DBG_LOG("Peak RAM lost:             %d bytes\r\n", s_memStatis.peak_ram_lost);
    MEM_DBG_LOG("Peak Upper Address:        %x\r\n", s_memStatis.peak_upper_addr);
#ifdef MEM_MANAGER_BENCH
    MEM_DBG_LOG("************************************************\r\n");
    MEM_DBG_LOG("********* MEM MANAGER BENCHMARK REPORT *********\r\n");
    MEM_DBG_LOG("Last Alloc Time:           %d us\r\n", s_memStatis.last_alloc_time);
    MEM_DBG_LOG("Last Alloc Block Size:     %d bytes\r\n", s_memStatis.last_alloc_block_size);
    MEM_DBG_LOG("Last Alloc Buffer Size:    %d bytes\r\n", s_memStatis.last_alloc_buff_size);
    MEM_DBG_LOG("Average Alloc Time:        %d us\r\n", s_memStatis.average_alloc_time);
    MEM_DBG_LOG("Peak Alloc Time:           %d us\r\n", s_memStatis.peak_alloc_time);
#endif /* MEM_MANAGER_BENCH */
    MEM_DBG_LOG("************************************************");
}
#endif /* MEM_STATISTICS_INTERNAL */

static bool initialized = false;

mem_status_t MEM_RegisterExtendedArea(memAreaCfg_t *area_desc, uint8_t *p_area_id, uint16_t flags)
{
    mem_status_t st = kStatus_MemSuccess;
    memAreaPrivDesc_t *p_area;
    uint32_t regPrimask = DisableGlobalIRQ();
    assert(offsetof(memAreaCfg_t, internal_ctx) == offsetof(memAreaPrivDesc_t, ctx));
    assert(sizeof(memAreaCfg_t) >= sizeof(memAreaPrivDesc_t));
    do
    {
        void_ptr_t ptr;
        blockHeader_t *firstBlockHdr;
        uint32_t initial_level;

        if (area_desc == NULL)
        {
            assert(flags == 0U);
            p_area = &heap_area_list;
            /* Area_desc can only be NULL in the case of the implicit default memHeap registration */
            if ((p_area->start_address.address_ptr != NULL) || (p_area->end_address.address_ptr != NULL))
            {
                st = kStatus_MemInitError;
                break;
            }
            /* The head of the area des list is necessarily the main heap */
            p_area->start_address.address_ptr = &memHeap[0];
            p_area->end_address.raw_address   = memHeapEnd;
            assert(p_area->end_address.raw_address > p_area->start_address.raw_address);
            p_area->next = NULL;
            if (p_area_id != NULL)
            {
                *p_area_id = 0u;
            }
        }
        else
        {
            uint32_t area_sz;

            memAreaPrivDesc_t *new_area_desc = (memAreaPrivDesc_t *)area_desc;
            assert((flags & AREA_FLAGS_RFFU) == 0U);
            /* Registering an additional area : memHeap nust have been registered beforehand */
            uint8_t id = 0;
            if (area_desc->start_address == NULL)
            {
                st = kStatus_MemInitError;
                break;
            }
            if (heap_area_list.start_address.address_ptr == NULL)
            {
                /* memHeap must have been registered before */
                st = kStatus_MemInitError;
                break;
            }
            area_sz = new_area_desc->end_address.raw_address - new_area_desc->start_address.raw_address;
            if (area_sz <= KB(1))
            {
                /* doesn't make sense to register an area smaller than 1024 bytes */
                st = kStatus_MemInitError;
                break;
            }

            for (p_area = &heap_area_list, id = 1; p_area->next != NULL; p_area = (memAreaPrivDesc_t *)p_area->next)
            {
                if (p_area == new_area_desc)
                {
                    st = kStatus_MemInitError;
                    break;
                }
                id++;
            }
            if (st != kStatus_MemSuccess)
            {
                break;
            }
            if (p_area_id != NULL)
            {
                /* Determine the rank of the area in the list and return it as area_id */
                *p_area_id = id;
            }
            p_area->next  = area_desc;     /* p_area still points to previous area desc */
            p_area        = new_area_desc; /* let p_area point to new element */
            p_area->flags = flags;
        }
        /* Here p_area points either to the implicit memHeap when invoked from MEM_Init or to the
         * newly appended area configuration descriptor
         */
        p_area->next    = NULL;
        ptr.address_ptr = p_area->start_address.address_ptr;
        firstBlockHdr   = ptr.block_hdr_ptr;

        /* MEM_DBG_LOG("%x %d\r\n", memHeap, heapSize_c/sizeof(uint32_t)); */

        /* Init firstBlockHdr as a free block */
        firstBlockHdr->next      = NULL;
        firstBlockHdr->used      = MEMMANAGER_BLOCK_FREE;
        firstBlockHdr->next_free = NULL;
        firstBlockHdr->prev_free = NULL;

#if defined(MEM_STATISTICS_INTERNAL)
        firstBlockHdr->buff_size = 0U;
#endif

        /* Init FreeBlockHdrList with firstBlockHdr */
        p_area->ctx.FreeBlockHdrList.head = firstBlockHdr;
        p_area->ctx.FreeBlockHdrList.tail = firstBlockHdr;
        initial_level = p_area->end_address.raw_address - ((uint32_t)firstBlockHdr + BLOCK_HDR_SIZE - 1U);

        p_area->low_watermark = initial_level;

#if defined(gMemManagerLightGuardsCheckEnable) && (gMemManagerLightGuardsCheckEnable == 1)
        MEM_BlockHeaderSetGuards(firstBlockHdr);
#endif

#if defined(MEM_STATISTICS_INTERNAL)
        /* Init memory statistics */
        MEM_Inits_memStatis(&p_area->ctx.statistics);
#endif

